Autodesk.Revit.UI.Events.ManagedCallEventArgs.GetDialogOptions
getDialogOptions
Since:
2027

Autodesk.Revit.UI.Events.ManagedCallEventArgs.Execute(Autodesk.Revit.DB.DialogOptions.DialogOptionsBase)
Show modal dialog.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.Events.ManagedCallEventArgs.Result
the result of ManagedCall event.
Since:
2027

Autodesk.Revit.UI.Events.ManagedCallEventArgs
The arguments used by the ManagedCall event, this event will be raised when Revit wants to show a dialog on GeneratedUiFrameWork.
Since:
2027